/*************************************************************************
	> FileName  : DefaultParam.cpp
	> Author    : zhouzhijun
	> Mail      : snjzzjun@163.com
	> CreateTime: 2019年06月11日 星期二 20时48分51秒
*************************************************************************/

#include <iostream>
using namespace std;

/*************************************************************************
* 默认参数：函数调用中省略了实参时自动使用的一个值
*   
*************************************************************************/
void func(int n, float b=1.2, char c='@')
{
    cout << n << ", " << b << ", " << c << endl;
}

int main(int argc, char *argv[])
{
    
    return 0;
}
