/*************************************************************************
	> FileName  : DefaultParam.cpp
	> Author    : zhouzhijun
	> Mail      : snjzzjun@163.com
	> CreateTime: 2019年06月11日 星期二 20时48分51秒
*************************************************************************/

#include <iostream>
using namespace std;

/*************************************************************************
* 默认参数：函数调用中省略了实参时自动使用的一个值
* 可以在定义的时候指定默认参数，也可以在声明的时候指定默认参数，
* 指定的默认参数只对当前的文件模块有效
*************************************************************************/
void func(int n, float b, char c = 'a')
{
    cout << n << ", " << b << ", " << c << endl;
}
