/*************************************************************************
	> FileName  : DefaultParam.cpp
	> Author    : zhouzhijun
	> Mail      : snjzzjun@163.com
	> CreateTime: 2019年06月11日 星期二 20时48分51秒
*************************************************************************/

#include <iostream>
using namespace std;

/*************************************************************************
* 在声明的时候指定默认参数，指定的默认参数只对当前文件模块有效   
*************************************************************************/
void func(int n, float b, char c='z');

/*************************************************************************
* 在同一个文件可以多次声明指定默认参数，
* 但指定的默认参数与之前指定的不能重复（重复了编译不能通过）
* 新增默认参数位置必须保证该参数在参数列表中其后的所有参数均有默认参数（不满足编译不能通过）
*************************************************************************/
void func(int n, float b = 5.20, char c);

int ThirdFuncTest(void)
{
    int a  = 10;
    float b = 3.14;
    
    func(a, b);
    func(a);
    
    return 0;
}
